# Дана строка s = 'bfgshbkis'
# Преобразовать её в строку 'ibs', используя оператор извлечения среза только один раз.

s = 'bfgshbkis'
print(s[-2:-7:-2])